/* # ***** BEGIN LICENSE BLOCK ***** */
/* # Version: MPL 1.1/GPL 2.0/LGPL 2.1 */
/* # */
/* # The contents of this file are subject to the Mozilla Public License Version */
/* # 1.1 (the \"License\"); you may not use this file except in compliance with */
/* # the License. You may obtain a copy of the License at */
/* # http://www.mozilla.org/MPL/ */
/* # */
/* # Software distributed under the License is distributed on an \"AS IS\" basis, */
/* # WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License */
/* # for the specific language governing rights and limitations under the */
/* # License. */
/* # */
/* # The Original Code is mozilla.org code. */
/* # */
/* # The Initial Developer of the Original Code is */
/* # Netscape Communications Corporation. */
/* # Portions created by the Initial Developer are Copyright (C) 1998 */
/* # the Initial Developer. All Rights Reserved. */
/* # */
/* # Contributor(s): */
/* # */
/* # Alternatively, the contents of this file may be used under the terms of */
/* # either of the GNU General Public License Version 2 or later (the \"GPL\"), */
/* # or the GNU Lesser General Public License Version 2.1 or later (the \"LGPL\"), */
/* # in which case the provisions of the GPL or the LGPL are applicable instead */
/* # of those above. If you wish to allow use of your version of this file only */
/* # under the terms of either the GPL or the LGPL, and not to allow others to */
/* # use your version of this file under the terms of the MPL, indicate your */
/* # decision by deleting the provisions above and replace them with the notice */
/* # and other provisions required by the GPL or the LGPL. If you do not delete */
/* # the provisions above, a recipient may use your version of this file under */
/* # the terms of any one of the MPL, the GPL or the LGPL. */
/* # */
/* # ***** END LICENSE BLOCK ***** */

"malformedURI" = "The URL is not valid and cannot be loaded.";
"fileNotFound" = "The file %S cannot be found. Please check the location and try again.";
"dnsNotFound" = "%S could not be found. Please check the name and try again.";
"protocolNotFound" = "%S is not a registered protocol.";
"connectionFailure" = "The connection was refused when attempting to contact %S.";
"netInterrupt" = "The connection to %S has terminated unexpectedly. Some data may have been transferred.";
"netTimeout" = "The operation timed out when attempting to contact %S.";
"redirectLoop" = "Redirection limit for this URL exceeded.  Unable to load the requested page.  This may be caused by cookies that are blocked.";
"confirmRepostPrompt" = "To display this page, the application must send information that will repeat any action (such as a search or order confirmation) that was performed earlier.";
"resendButton.label" = "Resend";
"unknownSocketType" = "This document cannot be displayed unless you install the Personal Security Manager (PSM). Download and install PSM and try again, or contact your system administrator.";
"netReset" = "The document contains no data.";
"netOffline" = "This document cannot be displayed while offline. To go online, select “Go Online” from the Camino menu.";
"isprinting" = "The document cannot change while Printing or in Print Preview.";
"deniedPortAccess" = "Access to the port number given has been disabled for security reasons.";
"proxyResolveFailure" = "The proxy server you have configured could not be found. Please check your proxy settings and try again.";
"proxyConnectFailure" = "The connection was refused when attempting to contact the proxy server you have configured. Please check your proxy settings and try again.";
"contentEncodingError" = "The page you are trying to view cannot be shown because it uses an invalid or unsupported form of compression.";
"unsafeContentType" = "The page you are trying to view cannot be shown because it is contained in a file type that may not be safe to open. Please contact the website owners to inform them of this problem.";
"externalProtocolTitle" = "External Protocol Request";
"externalProtocolPrompt" = "An external application must be launched to handle %1$S: links.\n\n\nRequested link:\n\n%2$S\n\nApplication: %3$S\n\n\nIf you were not expecting this request it may be an attempt to exploit a weakness in that other program. Cancel this request unless you are sure it is not malicious.\n";
/* #LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can’t be determined */
"externalProtocolUnknown" = "<Unknown>";
"externalProtocolChkMsg" = "Remember my choice for all links of this type.";
"externalProtocolLaunchBtn" = "Launch application";
"malwareBlocked" = "The site at %S has been reported as an attack site and has been blocked based on your security preferences.";
"phishingBlocked" = "The web site at %S has been reported as a web forgery designed to trick users into sharing personal or financial information.";
